Versionist_API_WEB/app/controllers/v1/books_controller.rb

	def index
		books = Book.all
---
SELECT `books`.* FROM `books`

	def show
		book = Book.find_by_id(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1

	def create
		book = Book.new(book_params)
		if book.save
---
INSERT INTO `books` (`title`, `author`, `weight`, `publisher`, `language`, `pages`, `publication_date`, `created_at`, `updated_at`) VALUES ('Create API with Versionist and Rails', 'Bang Tran', '100', 'Bang Tran', 'VietNameses', 111, '2018-10-20 00:00:00', '2018-03-10 06:35:31', '2018-03-10 06:35:31')

	def update
		book = Book.find_by_id(params[:id])
		if book.present? && book.update(book_params)
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
UPDATE `books` SET `title` = 'Updated', `author` = 'Bang Tran New', `weight` = '200', `publisher` = 'Bang Tran Newest', `language` = 'betonamu', `pages` = 220, `publication_date` = '2018-10-29 00:00:00', `updated_at` = '2018-03-10 06:39:50' WHERE `books`.`id` = 2

	def destroy
		book = Book.find_by_id(params[:id])
		if book.present? && book.destroy
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
DELETE FROM `books` WHERE `books`.`id` = 3